demo-app/app/controllers/contacts_controller.rb

  def edit
    @contact = Contact.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "1"]]

  def create
    @contact = Contact.new(params[:contact])

    respond_to do |format|
      if @contact.save
---
INSERT INTO "contacts" ("created_at", "email", "first_name", "last_name", "lead_type", "linkedin_profile", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @contact = Contact.find(params[:id])
---
SELECT "contacts".* FROM "contacts" WHERE "contacts"."id" = ? LIMIT 1  [["id", "3"]]